# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Resolvendo em Paralelo
#+Author: Prof. Lucas M. Schnorr (UFRGS)
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{../org-babel.tex}

** Assíncrono / Síncrono

Veja arquivos em:

#+begin_src sh :results output :session :exports both
find img/ | grep pdf$
#+end_src

#+RESULTS:
: img/non-blocking.csv-STATE-10-20.pdf
: img/blocking.csv-STATE-0-88.616592.pdf
: img/blocking.csv-STATE-10-20.pdf
: img/non-blocking.csv-STATE-0-50.725797.pdf

Links:

- Overview
  - Blocking: file:img/blocking.csv-STATE-0-88.616592.pdf
  - Non-blocking: file:img/non-blocking.csv-STATE-0-50.725797.pdf

- Zoom
  - Blocking: file:img/blocking.csv-STATE-10-20.pdf
  - Non-blocking: file:img/non-blocking.csv-STATE-10-20.pdf

